 &НаКлиенте
Перем ОтветПередДобавлением;
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)	
СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);

КонецПроцедуры


&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)	
СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры


&НаКлиенте
Процедура Подбор(Команда) 
	
ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, 
Элементы.Материалы);

КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеЗавершение(Результат, СписокНоменклатуры) Экспорт
Если Результат = КодВозвратаДиалога.Да Тогда
ОтветПередДобавлением = Истина;
Для Каждого ВыбранныйЭлемент Из СписокНоменклатуры Цикл
НоваяСтрока = Объект.Материалы.Добавить();
НоваяСтрока.Материал = ВыбранныйЭлемент;
КонецЦикла;
КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура МатериалыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

Если ОтветПередДобавлением <> Истина Тогда
СтандартнаяОбработка = Ложь;
Оповещение = Новый ОписаниеОповещения(
"ДобавлениеЗавершение", ЭтотОбъект, ВыбранноеЗначение);
ПоказатьВопрос(Оповещение, "Добавить номенклатуру в табличную часть?", 
РежимДиалогаВопрос.ДаНет);
Иначе
Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
НоваяСтрока = Объект.Материалы.Добавить();
НоваяСтрока.Материал = ВыбранныйЭлемент;
КонецЦикла;
КонецЕсли;

КонецПроцедуры
          &НаКлиенте
Процедура ПодборВопрос(Команда)
Оповещение = Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект);
ПоказатьВопрос(Оповещение, "Подобрать номенклатуру в документ?", 
РежимДиалогаВопрос.ДаНет);
КонецПроцедуры   


&НаКлиенте
Процедура ПодборЗавершение(Результат, Параметры) Экспорт
 Если Результат = КодВозвратаДиалога.Да Тогда
ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", 
ПараметрыФормы, Элементы.Материалы);
КонецЕсли; 
КонецПроцедуры